// Напишите программу, которая принимает на вход целое число
// из отрезка [10, 99] и показывает наибольшую цифру числа.


// /= разделение чисел(отсечение)

int number = 32;
int firstnumber = number / 10;
int secondnumber = number % 10;
//string str number = number.ToString;
//str numbe
//int maxnumber =
if (firstnumber > secondnumber)
{
    System.Console.WriteLine (firstnumber);
}
else
{
    System.Console.WriteLine (secondnumber);
}

